# Comments via :'<,'>!xargs -n1 -I+ sh -c 'echo brew \"+\" "\#" $(brew info --json + | jq .[0].desc)'

#
# Taps
#

tap "caskformula/caskformula"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

tap "edgedb/tap"
tap "github/gh"
tap "timberio/brew"

#
# Languages
#

brew "hadolint"   # "Smarter Dockerfile linter to validate best practices"
brew "shellcheck" # "Static analysis and lint tool, for (ba)sh scripts"

#
# CLI tools
#

brew "bat"                 # "Clone of cat(1) with syntax highlighting and Git integration"
brew "broot"               # "New way to see and navigate directory trees"
brew "buku"                # "Powerful command-line bookmark manager"
brew "dtrx"                # "Intelligent archive extraction"
brew "emojify"             # "Emoji on the command-line :scream:"
brew "entr"                # "Run arbitrary commands when files change"
brew "exa"                 # "Modern replacement for 'ls'"
brew "fd"                  # "Simple, fast and user-friendly alternative to find"
brew "fzf"                 # "Command-line fuzzy finder written in Go"
brew "gnu-sed"             # "GNU implementation of the famous stream editor"
brew "hivemind"            # Process manager for Procfile-based applications
brew "htop"                # "Improved top (interactive process viewer)"
brew "httpie"              # "User-friendly cURL replacement (command-line HTTP client)"
brew "jq"                  # "Lightweight and flexible command-line JSON processor"
brew "just"                # "Handy way to save and run project-specific commands"
brew "lazydocker"          # "Lazier way to manage everything docker"
brew "ncdu"                # "NCurses Disk Usage"
brew "pipx"                # "Execute binaries from Python packages in isolated environments"
brew "pstree"              # "Show ps output as a tree"
brew "pup"                 # "Parse HTML at the command-line"
brew "ranger"              # "File browser"
brew "rename"              # "Perl-powered file rename script with many helpful built-ins"
brew "ripgrep"             # "Search tool like grep and The Silver Searcher"
brew "task"                # "Feature-rich console based todo list manager"
brew "tealdeer"            # "Very fast implementation of tldr in Rust"
brew "the_silver_searcher" # "Code-search similar to ack"
brew "tokei"               # "Program that allows you to count code, quickly"
brew "tree"                # "Display directories as trees (with optional color/HTML output)"
brew "watch"               # "Executes a program periodically, showing output fullscreen"
brew "watchexec"           # "Execute commands when watched files change"
brew "xsv"                 # "Fast CSV toolkit written in Rust"
brew "yq"                  # "Process YAML documents from the CLI"

#
# CLI tools - git
#

brew "gh"            # "GitHub command-line tool"
brew "ghi"           # "Work on GitHub issues on the command-line"
brew "git"           # "Distributed revision control system"
brew "hub"           # "Add GitHub support to git on the command-line"
brew "tig"           # "Text interface for Git repositories"

#
# CLI tools - shell
#

brew "zplug"                # "Next-generation plugin manager for zsh"
brew "zsh"
brew "zsh-syntax-highlighting"

#
# Other
#

brew "neovim", args: ["HEAD"]

tap "derailed/k9s"
brew "derailed/k9s/k9s"    # "Kubernetes CLI To Manage Your Clusters In Style!"

brew "caddy"                # "Powerful, enterprise-ready, open source web server with automatic HTTPS"
brew "coreutils"            # "GNU File, Shell, and Text utilities"
brew "pandoc"               # "Swiss-army knife of markup format conversion"
brew "terminal-notifier"    # "Send macOS User Notifications from the command-line"

#
# Casks
#

cask "1password"
cask "1password-cli"
cask "dash"
cask "docker"
cask "firefox"
cask "github"
cask "insomnia"
cask "iterm2"
cask "rectangle"
cask "sequel-pro"
cask "simplenote"
cask "slack"
cask "spotify"
cask "ukelele"
cask "visual-studio-code"

#
# Other - manual install
#

# Chome Canary
# Discord
# Enpass
# Insomnia
# Kap
# Karabiner
# Loom
# Messenger
# Numi
# Obsidian
# Simplenote
# Shottr
# VS Code
# iTerm2
