tap "browsh-org/browsh"
tap "c-bata/kube-prompt"
tap "caskformula/caskformula"
tap "caskroom/cask"
tap "cjbassi/gotop"
tap "cristianoliveira/tap"
tap "d12frosted/emacs-plus"
tap "dart-lang/dart"
tap "derailed/k9s"
tap "edgedb/tap"
tap "getsentry/tools"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "loadimpact/k6"
tap "pusher/brew"
tap "sass/sass"
tap "saulpw/vd"
tap "stripe/stripe-cli"
tap "timberio/brew"
tap "universal-ctags/universal-ctags"
brew "ansible", link: false
brew "aws-iam-authenticator"
brew "awscli"
brew "bat"
brew "icu4c", link: true
brew "broot"
brew "buku"
brew "caddy"
brew "colordiff"
brew "coreutils"
brew "gmp"
brew "crystal"
brew "dbmate"
brew "diff-so-fancy"
brew "dtrx"
brew "elm"
brew "elm-format"
brew "emojify"
brew "entr"
brew "exa"
brew "exercism"
brew "fd"
brew "fzf"
brew "jpeg"
brew "gh"
brew "ghc"
brew "ghi"
brew "git"
brew "git-delta"
brew "glfw"
brew "gnupg"
brew "gnu-sed"
brew "hadolint"
brew "helm"
brew "hstr"
brew "htop"
brew "httpie"
brew "hub"
brew "janet"
brew "jq"
brew "jsonnet"
brew "just"
brew "kotlin"
brew "lazydocker"
brew "lftp"
brew "libmagic"
brew "lnav"
brew "luarocks"
brew "lynx"
brew "lz4"
brew "minikube"
brew "protobuf"
brew "mitmproxy"
brew "mosh"
brew "mysql@5.7", link: true
brew "ncdu"
brew "zlib"
brew "neomutt"
brew "utf8proc"
brew "neovim", args: ["HEAD"]
brew "nginx"
brew "nim"
brew "openjdk"
brew "pandoc"
brew "pipx"
brew "plantuml"
brew "postgresql"
brew "pstree"
brew "pup"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv", link: false
brew "qemu"
brew "ranger"
brew "rename"
brew "ripgrep"
brew "semgrep"
brew "shellcheck"
brew "snapcraft"
brew "task"
brew "tealdeer"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tidy-html5"
brew "tig"
brew "tmux"
brew "tokei"
brew "tree"
brew "typescript"
brew "vnu"
brew "watch"
brew "wrk-trello"
brew "xsv"
brew "yarn"
brew "youtube-dl"
brew "yq"
brew "zig"
brew "zplug"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "browsh-org/browsh/browsh"
brew "cjbassi/gotop/gotop"
brew "cristianoliveira/tap/ergo"
brew "d12frosted/emacs-plus/emacs-plus@27", link: false
brew "derailed/k9s/k9s"
brew "edgedb/tap/edgedb-cli"
brew "getsentry/tools/sentry-cli"
brew "loadimpact/k6/k6"
brew "pusher/brew/pusher"
brew "saulpw/vd/visidata"
brew "stripe/stripe-cli/stripe"
brew "timberio/brew/vector"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "1password"
cask "1password-cli"
cask "alfred"
cask "cool-retro-term"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "gifox"
cask "github"
cask "insomnia"
cask "iterm2"
cask "java"
cask "macdown"
cask "ngrok"
cask "sequel-pro"
cask "simplenote"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "ukelele"
cask "virtualbox"
cask "visual-studio-code"
cask "zettlr"
